#+STARTUP: indent
#+STARTUP: hidestars

#+PROPERTY: header-args :dir target/examples

#+PROPERTY: header-args:java  :cmdline -classpath .;../classes/
#+PROPERTY: header-args:java+ :cmpflag -classpath .;../classes/

**** Filtering

Use the method ~filter~ to create a new recipe that returns only those values, produced by another recipe, that match the given predicate.
Predicates can be negated by the [[https://docs.oracle.com/en/java/javase/11/docs/api/java.base/java/util/function/Predicate.html#not(java.util.function.Predicate)][Predicate#not]] operator.

#+begin_src  java :noweb-ref EXAMPLE_8 :eval never
  Recipe<Double> rec = Recipe
      .of(() -> current().nextDouble())
      .filter(x -> x > 0)
      .filter(not(x -> x.isInfinite()));

  System.out.println(rec.get());
  System.out.println(rec.get());
#+end_src

#+name: EXE_EXAMPLE_8
#+begin_src java :results output :exports results
  Examples.example8();
#+end_src

#+RESULTS: EXE_EXAMPLE_8
: 0.12826014636372696
: 0.3920702845614149

If the given predicate cannot be satisfied after 100 tries, runtime exception ~RecipeFilterException~ is thrown.

#+begin_src  java :noweb-ref EXAMPLE_9 :eval never
  Recipe<Integer> rec = Recipe
      .of(() -> current().nextInt())
      .filter(x -> x > 0 && x < 6);

  try {
      rec.get();
  } catch (RecipeFilterException ex) {
      System.out.println(ex.getMessage());
  }
#+end_src

#+name: EXE_EXAMPLE_9
#+begin_src java :results output :exports results
  Examples.example9();
#+end_src

#+RESULTS: EXE_EXAMPLE_9
: Couldn't satisfy predicate after 100 tries.

These problems can be fixed either by improving the underlying recipe or by relaxing the predicate (e.g. use ~current().nextInt(1, 6)~ instead of unbounded ~nextInt()~.

